#### MinorDirectionWireType Property

---

|  |
| --- |
| FabricSheetType Class   See Also |

The id of the FabricWireType to be used in the minor direction.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId MinorDirectionWireType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property MinorDirectionWireType As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ MinorDirectionWireType { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: the ElementId minorDirectionWireType is either invalid or not a FabricWireType. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: Fabric Sheet Type is Custom |

# See Also

FabricSheetType Class

Autodesk.Revit.DB.Structure Namespace